Tekla Open API Reference for Tekla Structures 2025
ModifiedObjectInfo Fields
The ModifiedObjectInfo type exposes the following members.
Fields
Name | Description
IsAttributeChanged
 Whether the object attribute (UDA) has changed.
IsCreated
Whether the object was created
IsModified
 Whether the object's has changed in a way that affects its numbering. This can include some UDA change.
IsNumberingChanged
 Whether the numbering of object has changed.
ModelObject
 Gets the object modified.
Top
See Also
Reference
ModifiedObjectInfo Structure
Tekla.Structures.Model.History Namespace